_org_posts/_posts/2021-10-10-boj-19583.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: BOJ 19583 싸이버개강총회
#+HTML: tags: STL
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 19583 싸이버개강총회

** 접근하기
- STL map객체로 이름으로 enter/leave를 check한다.
- 채팅 메시지는 여러줄 출력할 수 있음. 한번만 count하기

** 코드
#+BEGIN_SRC cpp
#include <cstdio>
#include <map>
#include <string>
#include <algorithm>

using namespace std;

int start_h, start_m;
int end_h, end_m;
int metube_h, metube_m;

int main(int argc, char* argv[])
{
    scanf("%d:%d", &start_h, &start_m);
    scanf("%d:%d", &end_h, &end_m);
    scanf("%d:%d", &metube_h, &metube_m);

    int t1 = start_h * 60 + start_m;
    int t2 = end_h * 60 + end_m;
    int t3 = metube_h * 60 + metube_m;
    
    int in_h, in_m;
    char name[30];

    map<string, int> mp1; 

    int cnt = 0;
    while(scanf("%d:%d %s", &in_h, &in_m, name) != EOF) {
        int now = in_h * 60 + in_m;
        if (now <= t1) {
            mp1[string(name)] = 1;
        }

        if (t2 <= now && now <= t3) {
            if (mp1[string(name)] == 1) {
                mp1[string(name)] = 2;
                cnt += 1;
                //printf(">%s\n", name);
            }
        }
    }
    printf("%d\n", cnt);
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/19583
