_posts/2021-10-10-boj-19583.html
---
layout: post
title: BOJ 19583 싸이버개강총회
tags: STL
---

<div id="outline-container-org66ae891" class="outline-2">
<h2 id="org66ae891">BOJ 19583 싸이버개강총회</h2>
</div>

<div id="outline-container-orgab81081" class="outline-2">
<h2 id="orgab81081">접근하기</h2>
<div class="outline-text-2" id="text-orgab81081">
<ul class="org-ul">
<li>STL map객체로 이름으로 enter/leave를 check한다.</li>
<li>채팅 메시지는 여러줄 출력할 수 있음. 한번만 count하기</li>
</ul>
</div>
</div>

<div id="outline-container-org8bd5211" class="outline-2">
<h2 id="org8bd5211">코드</h2>
<div class="outline-text-2" id="text-org8bd5211">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;map&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>

<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">start_h</span>, <span style="color: #ff6347;">start_m</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">end_h</span>, <span style="color: #ff6347;">end_m</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">metube_h</span>, <span style="color: #ff6347;">metube_m</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d:%d"</span>, &amp;start_h, &amp;start_m);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d:%d"</span>, &amp;end_h, &amp;end_m);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d:%d"</span>, &amp;metube_h, &amp;metube_m);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">t1</span> = start_h * 60 + start_m;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">t2</span> = end_h * 60 + end_m;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">t3</span> = metube_h * 60 + metube_m;

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">in_h</span>, <span style="color: #ff6347;">in_m</span>;
    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">name</span>[30];

    <span style="color: #8ae234; font-weight: bold;">map</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">mp1</span>; 

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(scanf(<span style="color: #ad7fa8; font-style: italic;">"%d:%d %s"</span>, &amp;in_h, &amp;in_m, name) != EOF) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">now</span> = in_h * 60 + in_m;
        <span style="color: #729fcf; font-weight: bold;">if</span> (now &lt;= t1) {
            mp1[string(name)] = 1;
        }

        <span style="color: #729fcf; font-weight: bold;">if</span> (t2 &lt;= now &amp;&amp; now &lt;= t3) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (mp1[string(name)] == 1) {
                mp1[string(name)] = 2;
                cnt += 1;
                <span style="color: #888a85;">//</span><span style="color: #888a85;">printf("&gt;%s\n", name);</span>
            }
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, cnt);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org033a025" class="outline-2">
<h2 id="org033a025">문제 링크</h2>
<div class="outline-text-2" id="text-org033a025">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/19583">https://www.acmicpc.net/problem/19583</a></li>
</ul>
</div>
</div>
